index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Henke Larsson AB</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Henke Larsson AB</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6a158ce">Static vs dynamic arrays, C vs Zig arrays</a></li>
<li><a href="#org6b1df74">Sorry about the spelling will setup spellchecking for org mode but right now just playing around.</a></li>
<li><a href="#org2bbcee0">Tools I use for private</a>
<ul>
<li><a href="#org0e976de">Things I keep coming back to so they</a></li>
<li><a href="#org7926ada">Developer setup</a></li>
<li><a href="#org25010af">Recent things that has might fit in the list above</a></li>
<li><a href="#orgc2fc6dc">Projects that interest me</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6a158ce" class="outline-2">
<h2 id="org6a158ce">Static vs dynamic arrays, C vs Zig arrays</h2>
<div class="outline-text-2" id="text-org6a158ce">
<ul class="org-ul">
<li>arrays are static or dynamic and they always have memory adjectent layout which allow us to use a pointer + offset strategy to acces them</li>
<li>linked list do not need linear memory show impl in zig and c</li>
<li><p>
hashmap impl show impl in zig and c
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {
    printf(<span style="font-style: italic;">"Hello, World!\n"</span>);
    <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-zig">const std = @import("std");
pub fn main() void {
    std.debug.print("Hello, World!\n", .{});
}
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org6b1df74" class="outline-2">
<h2 id="org6b1df74">Sorry about the spelling will setup spellchecking for org mode but right now just playing around.</h2>
</div>

<div id="outline-container-org2bbcee0" class="outline-2">
<h2 id="org2bbcee0">Tools I use for private</h2>
<div class="outline-text-2" id="text-org2bbcee0">
<p>
This is things I like for private use, I do not make any claims of what are best in an enterprise setting. When making choices for an enterprice there are so many additional things that come in then selecteing just the right tool for the job.
</p>
</div>

<div id="outline-container-org0e976de" class="outline-3">
<h3 id="org0e976de">Things I keep coming back to so they</h3>
<div class="outline-text-3" id="text-org0e976de">
<p>
Here are things that I keep coming back to, this is things I compare all other things to since they are really what I consider the best for me
</p>
<ul class="org-ul">
<li><a href="https://clojure.org/">Clojure</a></li>
<li><a href="https://www.gnu.org/software/emacs/">Emacs</a></li>
<li><a href="https://nixos.org/">NixOS</a></li>
<li><a href="https://blog.stenmans.org/theBeamBook/">BEAM</a></li>
<li><a href="https://elm-lang.org/">Elm</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7926ada" class="outline-3">
<h3 id="org7926ada">Developer setup</h3>
<div class="outline-text-3" id="text-org7926ada">
<ul class="org-ul">
<li><a href="https://levus.co/">Levus</a></li>
<li><a href="https://www.zsa.io/voyager">ZSA Voyager</a></li>
</ul>
</div>
</div>

<div id="outline-container-org25010af" class="outline-3">
<h3 id="org25010af">Recent things that has might fit in the list above</h3>
<div class="outline-text-3" id="text-org25010af">
<ul class="org-ul">
<li><a href="https://odin-lang.org/">Odin</a>
After trying some of the hyped systems level programming langauges like Zig, Jai, Rust, C3, Nim. Odin is the one that makes me feel the same when I do systems level programming as Clojure makes me feel when I do random exploratory stuff. It is a Joy to program in but has not used it long enogh to know if I will keep coming back to it or if I will move on.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2fc6dc" class="outline-3">
<h3 id="orgc2fc6dc">Projects that interest me</h3>
<div class="outline-text-3" id="text-orgc2fc6dc">
<ul class="org-ul">
<li><a href="https://www.roc-lang.org/">Roc</a>
Not really formed an opinion but it can be cool one day.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
